[
	{"company":"pinjamanku","service": "UI & Web Development","background":"<p>Pinjamanku is online lending service that partner with some of country’s biggest lending platform, BFI and WOM to help small-medium enterprise grow their business.</p>","challenge":"<p>There are already lot of competitor in this area, we need to create better online experience than what the competitor does. So our system should have responsive design, fast loading time and SEO friendly.</p>","process":"<p>We use our modified ChooJS to generate static-site website that load fast and SEO friendly. For the MVP, we use Firebase as database service and create dashboard for the administrator to track the applicant.</p>","result":"<p>We deliver the result in just 2 weeks (1 week of design and 1 week of build). Pinjamanku team was impressed by our fast deliverable and performance of the system. Faster deliverable means they can immediately enter the market and grow their business.</p>"},
	{"company":"meshmaker","service": "Web & API Development","background":"<p>Meshmaker is a startup idea to accomodate the creative nerds to help them get their 3D design comes to life. The marketplace where people can buy/sell their 3D design and print it for them in easy way.</p>","challenge":"<p>The customer should be able to upload their 3D file and the system will calculate the price based on their specification such as the size and material used. At that time, there are no usable API to calculate 3D file price point, so we need to built our own 3D price calculator API.</p> <p>We also need to automatically calculate the shipping price from meshmaker HQ to users home. Last thing to create dashboard that can render the 3D file and track all the order that the users have made.</p>","process":"<p>We to built the system from ground up. We architect the whole system using state-of-the-art Javascript technologies and API-first approach. We use Express as our backend and React in our frontend.</p> <p>To calculate the price, we need to find out the weight of the 3D model, we use slic3r an open-source 3D slicing engine that can calculate the weight. We integrate our backend with the 3D slicing engine by creating queue mechanism.To calculate the shipping price, we use API from rajaongkir that already integrate with country’s mostly used shipping company such as JNE, POS, TIKI, etc.</p> <p>For the frontend, we render the 3D file on the dashboard using react-stl-viewer that use D3.js to visualize the 3D file. We do some modification on the library to let it update the color of model on the fly.</p>","result":"<p>Meshmaker was happy with the system and our deliverable time. We built it the system in 1 month and help them enter the market faster to accomodate the creative nerds. </p>"},
	{"company":"brandedmanstore","service": "Instagram Automation","background":"<p>Brandedmanstore (BMS) is new e-commerce that was establised in late 2017. To grow their sales, they need marketing tools to increase brand awareness and generate leads. One of their strategy is using the “0.2 cents strategy” by Gary Vee, they reach out to us to help them automate the strategy.</p>","challenge":"<p>Unfortunately, Instagram deprecated their API so we need another way of getting access into the platform. The 0.2 cents strategy works by liking, commenting and following real account that post in some hashtag or location, so the goal is to create instagram automation that can do that. The automation also needs to be able to run automatically every single day at specified time.</p>","process":"<p>We found out the solution is to crawl the Instagram web, to avoid Instagram malicious detector we set up some delay in every action that our automation do. </p> <p>We use puppeteer as our headless browser and run it on our server 24 x 7. Before interact with other account, our automation look up their profile such as number of post, followers and following and if their profile looks real our automation continue to interact with that account. </p> <p>For scheduling, we use cron job to trigger our automation to run at specified time when most people actively using their Instagram. </p>","result":"<p>On weekly basis, our instagram automation help BMS get 350+ followers, 4k+ reach, 60k+ impressions and 5k+ profile visit. BMS team was satisfied with the result and already planned future another project with us.</p>"}
]